= 結果と講評

さて、長らくお待たせしました。厳正なる審査の結果、機械学習の力を借りて現代に蘇った石川啄木の最後の一首、
その内容はこちらに決定しました。

//indepimage[result]

……いかがでしょうか。これが「石川啄木最後の一首」として相応しいかどうかの判断は読者の皆様に任せますが、
いちおう製作者として並ひと通りのことは述べておきます。

ちなみに、この画像は啄木の死の直後に出版された、件の東雲堂版『悲しき玩具 : 一握の砂以後』の体裁に
なるべく近づけてあります。字形や書体もなるべく元の通りの物を目指しました。

== 講評

この自動生成された短歌について軽く講評を述べます。

まず、上の句。「大跨に緣側を歩けば、板軋む。」となっていますが、
この部分はかなりいい感じです。大股でずっしりと縁側を歩けばその重みを受けて床板が軋む。
これは文章としても非常に自然な流れですし、実際に啄木がこう詠んでいたとしても不思議ではありません。
動作としての「大跨」と、音響としての「板軋む」によって、
視覚と聴覚に訴えかける、日常の風景に溶け込んだ精密な情景描写を見事に果たしています。

この「板軋む」と続く「かへりける」の部分は、『一握の砂』所収の一首、
「きしきしと寒さに踏めば板軋む／かへりの廊下の／不意のくちづけ」に対応しています。

二行目、「かへりけるかな――」となっています。失速の感が否めません。
切れ字の「かな」で一度切ることにより情緒と余韻を詠うのは、啄木のみならず俳諧歌壇一般に通じる原則ですが、
ここまでの流れから、曖昧な「帰る／返る」の一語でそれほどの情緒が生まれるとは思えません。
また「かへる」の目的語がはっきりとせず（当然ですが、縁側は普通家にあるもので、
どこかに帰るための場所ではありません）、どうも自然主義を擁した啄木の歌風ではありません。
どちらかというとこの表現は同時期の耽美派詩人たちを彷彿とさせます。

啄木がこの書きかけの短歌を最後に筆を擱き、この世を去ったことを考えると、
この「かへりけるかな」を「黄泉に帰る」の意と取る邪推もできるかもしれません。
しかし、今回の機械学習による自動生成では（当然ですが）歌が詠まれた状況による判断を考慮に入れていないため、
そのような意図が込められるはずもありません。
ましてこれを以って「啄木は臨終を前に自らの死を歌にしようとしていた」などと判断するのは、
かえって彼に対する冒涜ともなるでしょう。

最後に、「道広くなりき。」とあります。道という単語には縁側を歩くという状況に通じるものがありますが、
あまりいい締め方ではないと思われます。
少なくとも物理的に縁側が広くなったという状況を詠んでいるとは考えにくいですし、
なにか抽象的な「道」を想定している（例えば、人生を道に見立てているとか）としても、
上の句との一貫性がなく、意味も取りにくくなってしまいます。

この「道広く」の表現は同じく『一握の砂』所収の
「ふるさとに入りて先づ心傷むかな／道広くなり／橋もあたらし」から取られたものです。
要するに元の歌では物理的に「道広く」なっている状況を詠っているのであって、
その意味でもこの文脈には似つかわしくないでしょう。

全体として、これをそのまま「啄木が書きそびれた最後の一首である」として胸を張って提出するには
少し苦しい結果かもしれません。
しかしこれが、人為的な介入なく、完全な自動生成によって推定された短歌であることを考慮すると、
そこまで悪くない結果かもしれません。

== 結果詳細

正直、スコア1位の短歌だけ見ても、今回の結果がどの程度のものだったのかはわかりません。

最終評価によるスコアが高い順に100個抽出したのが以下の表です。

//table[result-detail][評価結果詳細]{
短歌	スコア
-------------------------------------------------------------
大跨に 緣側を歩けば 板軋む かへりけるかな 道広くなりき	-532.371148069
大跨に 緣側を歩けば 板軋む かへりけるかな 道広くなりし	-532.371148069
大跨に 緣側を歩けば 板軋む かへりけるかな 道広くなり	-532.371148069
大跨に 緣側を歩けば 名も畑も 売り売りて蟹と 寄りてまじまじと	-516.204118687
大跨に 緣側を歩けば ゆくりなく つめたきものの 火桶に迎へし	-504.969091813
大跨に 緣側を歩けば 名も畑も 似たとうたがひぬ わが恋を指を	-500.649132984
大跨に 緣側を歩けば すっきりと 胸いたむ日より 飛びおりるごとき	-496.563432388
大跨に 緣側を歩けば はかなし夜も 畑も売り売りて 手垢きたなき	-495.765208243
大跨に 緣側を歩けば 此処に我は いかめし母も 畑も売り売りて	-484.42951418
大跨に 緣側を歩けば 二階より 町よな歌の 牧場の火桶に	-452.811059411
大跨に 緣側を歩けば 板軋む かへりの仔馬 走らせし十	-443.431431181
大跨に 緣側を歩けば うろたへて あまたたび夢 さめてひと晩に	-438.026772527
大跨に 緣側を歩けば 煙草かな 道広くなり 橋の夜ふけに	-429.110206349
大跨に 緣側を歩けば 胸の笠に 重ねゐる心 いたまむやむや	-423.409932278
大跨に 緣側を歩けば 板軋む かへりの廊下の とけて温めば	-417.382041502
大跨に 緣側を歩けば 先づ心 傷むかな道 広くなり橋も	-408.483274412
大跨に 緣側を歩けば 先づ心 傷むかな道 広くなり橋の	-408.483274412
大跨に 緣側を歩けば 鬼のごとく さまよひ行きぬ うらやましさあり	-407.226725058
大跨に 緣側を歩けば うろたへて し袷の春の 火鉢に泣かうか	-406.451164682
大跨に 緣側を歩けば 二晩かな 道広くなり 物足らぬ目付	-397.805002809
大跨に 緣側を歩けば うろたへて 人生終る すべなきか死なむ	-396.352136
大跨に 緣側を歩けば 身体が みな己が道 広くなり家	-395.238049498
大跨に 緣側を歩けば 板軋む かへりの廊下の ゆきかへりかな	-390.376082089
大跨に 緣側を歩けば 板軋む かへりのぬるさ あり死ぬならば	-386.303183559
大跨に 緣側を歩けば 板軋む かへりて室に 白塗の窓を	-384.08637029
大跨に 緣側を歩けば 板軋む かへりの焼くる にほひ栓抜けば	-383.035061153
大跨に 緣側を歩けば うろたへて 人生終る すべなきが水の	-382.386318282
大跨に 緣側を歩けば 君来る 植民地かな 道広くなりて	-380.805945468
大跨に 緣側を歩けば 逃げてゆく 村に迎へし 蚯蚓の徹夜	-379.580948838
大跨に 緣側を歩けば 板軋む かへりの夜霧 下りゆきて手	-378.021862828
大跨に 緣側を歩けば 板軋む かへりの障子を 見上ぐる男	-377.44587632
大跨に 緣側を歩けば 板軋む かへりて見は この世さびしくも	-376.66154715
大跨に 緣側を歩けば 白き皿の 軒端なつかし家 売り売り売りて	-375.5152988
大跨に 緣側を歩けば 生命が 戸外に馬に 向いて剣の	-373.048597312
大跨に 緣側を歩けば 板軋む かへりの凍る 真夜中の師を	-372.243733849
大跨に 緣側を歩けば 板軋む かへりけるかな 長き一生を	-370.941457912
大跨に 緣側を歩けば 板軋む かへりのまねを 終るすべなきか	-370.75997767
大跨に 緣側を歩けば 板軋む かへりて温めば おのづから目が	-369.923458049
大跨に 緣側を歩けば そのあまり 軽きに女 教師も畑も	-369.253951459
大跨に 緣側を歩けば おほよその ぬるさよ夜汽車に 迎へし朝から	-369.148675835
大跨に 緣側を歩けば 板軋む かへりてにはかに 踞し泣き笑ひ	-368.90688818
大跨に 緣側を歩けば 板軋む かへりてにはかに 踞し泣き笑ひし	-368.90688818
大跨に 緣側を歩けば 板軋む かへりの廊下に 立ちにし老ゆらし	-368.482927423
大跨に 緣側を歩けば 先づ心 傷むかな道 広くなり弱い	-368.178788408
大跨に 緣側を歩けば 何か一の 鬢の衰へを すべて謀叛気に	-367.336842678
大跨に 緣側を歩けば 板軋む かへりの背丈の 教へしごとし	-367.309607252
大跨に 緣側を歩けば 身体が 酒肆の 絵見しが欲しく	-367.305167854
大跨に 緣側を歩けば ゆくりなく つめたきものかも 畑も撃てよかし	-367.076137989
大跨に 緣側を歩けば ならぬかな 道広くなり 橋のつもりで	-365.933175226
大跨に 緣側を歩けば はかなし夜も 畑もゆかりも ひそかに願へる	-362.557573338
大跨に 緣側を歩けば 身体が させば板軋む かへりけるかな	-360.684475079
大跨に 緣側を歩けば ならぬかな 道広くなり 橋のなさぬ時	-360.042066184
大跨に 緣側を歩けば ふるさとに つく友も畑も あり公園に	-359.784148278
大跨に 緣側を歩けば 板軋む かへりの暮れゆく 空と酒かな	-358.759862387
大跨に 緣側を歩けば はかなし夜も さびしがるかな 道広くなり	-357.07786698
大跨に 緣側を歩けば 身体が 何故かうか 今月も畑も	-356.813023917
大跨に 緣側を歩けば 胸いたむ 日のおくり来ぬ 我に疲れて	-356.382136703
大跨に 緣側を歩けば 先づ心 いたまむと夜霧 下りゆきて手の	-355.869506704
大跨に 緣側を歩けば 板軋む かへりの廊下の めでたさかなと	-354.763741509
大跨に 緣側を歩けば びっくりして 蜜柑の倶知安 駅に下り立ち	-353.991938856
大跨に 緣側を歩けば うろたへては 煙草恵めと 寄りて温めば	-352.891387719
大跨に 緣側を歩けば 板軋む かへりの慾に 燃ゆる眼閉づれど	-352.720311148
大跨に 緣側を歩けば うろたへて 幅広き街 見よげなる人が	-350.491347956
大跨に 緣側を歩けば うしなひしが 戸外に消えむと 我にてありし	-350.365653338
大跨に 緣側を歩けば 板軋む かへりのそとを はかるに扉を	-349.286231555
大跨に 緣側を歩けば やらむなみだ 誘はる日より 飛びおりるごとき	-348.913902491
大跨に 緣側を歩けば 先づ心 傷むかな道 広くなりけり	-348.550453221
大跨に 緣側を歩けば 出て先づ 心傷むかな 道広くなり	-348.550453221
大跨に 緣側を歩けば 先づ心 傷むかな道 広くなりたり	-348.550453221
大跨に 緣側を歩けば 板軋む かへりの廊下に 羨みきあはれ	-348.352875054
大跨に 緣側を歩けば いふ言葉は 今とある日毎 日かな道広く	-346.601834204
大跨に 緣側を歩けば ならぬ癖も つけるかなしき 日かな道広く	-345.888548403
大跨に 緣側を歩けば 板軋む かへりの軒に 冬早く校を	-344.557374108
大跨に 緣側を歩けば 飽かなく幾 度来に消えむ やむやせ止せて	-343.084689597
大跨に 緣側を歩けば ふるさと人 そ我かな道 広くなり橋も	-342.655463148
大跨に 緣側を歩けば あをじろき 頬の麺麭かな道 広くなり心	-341.581639738
大跨に 緣側を歩けば 板軋む かへりて眠るが 夜汽車を終る	-341.307769051
大跨に 緣側を歩けば 鬼のごとく おそれつつ日前 歯にののしりし	-340.627372491
大跨に 緣側を歩けば 悲しみが 戸外にこころ ひかれてし十	-340.073559085
大跨に 緣側を歩けば 白き顔も 長くわすれぬ うらやましさと	-339.845863424
大跨に 緣側を歩けば はかなし夜も なつかしきかな 道広くなり	-339.578076943
大跨に 緣側を歩けば 生命が 戸外に三十 円も弱るらむ	-339.147382937
大跨に 緣側を歩けば 板軋む かへりの玉手 さし捲く夜も	-339.00271894
大跨に 緣側を歩けば かな息する 物思ひかな 道広くなり	-338.943747218
大跨に 緣側を歩けば 板軋む かへりの我と 不具の遊船に	-338.508689493
大跨に 緣側を歩けば 板軋む かへりて遊ぶ ものと何か気に	-337.867469127
大跨に 緣側を歩けば 板軋む かへりて深夜の なやみときどきに	-336.848962601
大跨に 緣側を歩けば 茶碗を気も かをりこころに 沁みに迎へし	-336.821848174
大跨に 緣側を歩けば 板軋む かへりて眠るが させば板軋む	-332.655865439
大跨に 緣側を歩けば 板軋む かへりの教師も ありしに翳し	-332.550890286
大跨に 緣側を歩けば うろたへて 止みたりきかせし 似るかこの日頃	-331.352206714
大跨に 緣側を歩けば その猫が また胸いたむ 日のありと千	-331.187724827
大跨に 緣側を歩けば 板軋む かへりて猫の まねなど呷らむ	-330.447669874
大跨に 緣側を歩けば うろたへて 廊下に蛙 聴きて深夜に	-330.148585172
大跨に 緣側を歩けば 板軋む かへりて死なまし 思ふ何となく	-329.34879091
大跨に 緣側を歩けば とある日は それを横より 飛びおりるごとき	-328.930527978
大跨に 緣側を歩けば すっきりと よろこべるかな 道広くなり	-328.514460822
大跨に 緣側を歩けば 板軋む かへりの廊下に 立ちぬ深夜の	-327.808867955
大跨に 緣側を歩けば 板軋む かへりて山は ありがたきかな	-327.786932924
大跨に 緣側を歩けば 板軋む かへりのかすかに 沢山の鈴の	-327.310199608
//}

結果的に、「石川啄木の歌」カテゴリに分類される確からしさはすぐに頭打ちになってしまったので、
そのうち、「石川啄木の歌でない」カテゴリに分類される確からしさが少ない順に並べてあります。

正直、驚きました。先ほど「板軋む」の部分は「かなりいい感じ」と述べましたが、
これを使用した歌がちゃんと上位にランクインしています。
惜しむらくは「板軋む」の続きが「かへり」しか存在しないことでしょうか。
これはマルコフ連鎖のアルゴリズムを改善することによってなんとかなるかもしれません。

あと、「道広く」を使用した短歌もスコアが高い傾向にあります。
このあたり、ちゃんと初二句との関連が深い単語をしっかり選べているようでいい感じです。

== まとめ

今回、マルコフ連鎖と機械学習、そして大規模シソーラスを用いた意味分類による
「作家らしさ」の定量計測という実験的な試みを試してみましたが、
それなりに「ちゃんとした」短歌っぽいものが生成されました。

ですが現状真に啄木の歌風を再現したとは到底言いがたく、
啄木の最後の短歌を復元するためにさらなる改善が期待されます。
具体的には、学習データをもっと増やす、
単純な形態素の遷移に基づくマルコフ連鎖による短歌生成をよりバリエーションの高い生成文法によって置き換える、
シソーラスの細かい分類も考慮に入れるなどが考えられます。
